; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_4 ?v8 ?v13)
             (pred_5 ?v10 ?v1)
             (pred_8 ?v8 ?v1)
             (pred_10 ?v12 ?v8 )
	     (pred_2 ?v8)
             (pred_6 ?v6)
             (pred_1 ?v10)
             (pred_7 ?v1)
             (pred_3 ?v8)
             (pred_11 ?v10)
             (pred_9 ?v8)
             (pred_12 ))



(:action op_3
:parameters (?v9 ?v3 ?v5 ?v4)
:precondition (and (pred_6 ?v9) (pred_6 ?v3) (pred_1 ?v5) (pred_7 ?v4)
          (pred_4 ?v9 ?v3) (pred_5 ?v5 ?v4)
                   (pred_8 ?v3 ?v4) (pred_2 ?v9) 
                   (pred_3 ?v3) (pred_11 ?v5))
:effect (and  (pred_9 ?v3) (not (pred_3 ?v3))))


(:action op_1
:parameters (?v9 ?v2)
:precondition (and (pred_6 ?v9) (pred_6 ?v2)
               (pred_2 ?v9) (pred_4 ?v9 ?v2) (pred_9 ?v2))
:effect (and (pred_2 ?v2) (not (pred_2 ?v9))))

(:action op_4
:parameters (?v9 ?v5)
:precondition (and (pred_6 ?v9) (pred_1 ?v5) 
                  (pred_2 ?v9) (pred_10 ?v5 ?v9) (pred_12 ))
:effect (and (pred_11 ?v5)
   (not (pred_10 ?v5 ?v9)) (not (pred_12 ))))


(:action op_5
:parameters (?v9 ?v11 ?v7)
:precondition (and (pred_6 ?v9) (pred_1 ?v11) (pred_1 ?v7)
                  (pred_2 ?v9) (pred_11 ?v7) (pred_10 ?v11 ?v9))
:effect (and (pred_11 ?v11) (pred_10 ?v7 ?v9)
        (not (pred_11 ?v7)) (not (pred_10 ?v11 ?v9))))

(:action op_2
:parameters (?v9 ?v5)
:precondition (and (pred_6 ?v9) (pred_1 ?v5) 
                  (pred_2 ?v9) (pred_11 ?v5))
:effect (and (pred_12 ) (pred_10 ?v5 ?v9) (not (pred_11 ?v5)))))

; problem
(define (problem grid-4-4-3-3-3)
    (:domain grid)
    (:objects
    obj_08 obj_17 obj_16 obj_14 obj_05 obj_20 obj_02 obj_11 obj_04 obj_07 obj_19 obj_15 obj_03 obj_12 obj_01 obj_22
    obj_09 obj_10 obj_13
    obj_18 obj_21 obj_06
    )

    (:init
       (pred_12)

       (pred_6 obj_08)
       (pred_6 obj_17)
       (pred_6 obj_16)
       (pred_6 obj_14)
       (pred_6 obj_05)
       (pred_6 obj_20)
       (pred_6 obj_02)
       (pred_6 obj_11)
       (pred_6 obj_04)
       (pred_6 obj_07)
       (pred_6 obj_19)
       (pred_6 obj_15)
       (pred_6 obj_03)
       (pred_6 obj_12)
       (pred_6 obj_01)
       (pred_6 obj_22)
       (pred_7 obj_09)
       (pred_7 obj_10)
       (pred_7 obj_13)
       (pred_1 obj_18)
       (pred_1 obj_21)
       (pred_1 obj_06)

       (pred_4 obj_08 obj_05)
       (pred_4 obj_08 obj_17)
       (pred_4 obj_17 obj_20)
       (pred_4 obj_17 obj_16)
       (pred_4 obj_17 obj_08)
       (pred_4 obj_16 obj_02)
       (pred_4 obj_16 obj_14)
       (pred_4 obj_16 obj_17)
       (pred_4 obj_14 obj_11)
       (pred_4 obj_14 obj_16)
       (pred_4 obj_05 obj_04)
       (pred_4 obj_05 obj_20)
       (pred_4 obj_05 obj_08)
       (pred_4 obj_20 obj_07)
       (pred_4 obj_20 obj_02)
       (pred_4 obj_20 obj_17)
       (pred_4 obj_20 obj_05)
       (pred_4 obj_02 obj_19)
       (pred_4 obj_02 obj_11)
       (pred_4 obj_02 obj_16)
       (pred_4 obj_02 obj_20)
       (pred_4 obj_11 obj_15)
       (pred_4 obj_11 obj_14)
       (pred_4 obj_11 obj_02)
       (pred_4 obj_04 obj_03)
       (pred_4 obj_04 obj_07)
       (pred_4 obj_04 obj_05)
       (pred_4 obj_07 obj_12)
       (pred_4 obj_07 obj_19)
       (pred_4 obj_07 obj_20)
       (pred_4 obj_07 obj_04)
       (pred_4 obj_19 obj_01)
       (pred_4 obj_19 obj_15)
       (pred_4 obj_19 obj_02)
       (pred_4 obj_19 obj_07)
       (pred_4 obj_15 obj_22)
       (pred_4 obj_15 obj_11)
       (pred_4 obj_15 obj_19)
       (pred_4 obj_03 obj_12)
       (pred_4 obj_03 obj_04)
       (pred_4 obj_12 obj_01)
       (pred_4 obj_12 obj_07)
       (pred_4 obj_12 obj_03)
       (pred_4 obj_01 obj_22)
       (pred_4 obj_01 obj_19)
       (pred_4 obj_01 obj_12)
       (pred_4 obj_22 obj_15)
       (pred_4 obj_22 obj_01)
       (pred_3 obj_08)
       (pred_3 obj_15)
       (pred_3 obj_11)
       (pred_8  obj_08 obj_09)
       (pred_8  obj_15 obj_10)
       (pred_8  obj_11 obj_13)
       (pred_9 obj_17)
       (pred_9 obj_16)
       (pred_9 obj_14)
       (pred_9 obj_05)
       (pred_9 obj_20)
       (pred_9 obj_02)
       (pred_9 obj_04)
       (pred_9 obj_07)
       (pred_9 obj_19)
       (pred_9 obj_03)
       (pred_9 obj_12)
       (pred_9 obj_01)
       (pred_9 obj_22)

       (pred_5  obj_18 obj_09)
       (pred_5  obj_21 obj_10)
       (pred_5  obj_06 obj_13)
       (pred_10 obj_18 obj_02)
       (pred_10 obj_21 obj_22)
       (pred_10 obj_06 obj_01)
       (pred_2 obj_05)
    )

    (:goal (and
       (pred_10 obj_21 obj_01)
       (pred_10 obj_06 obj_22)
    ))
(:constraints
  (always (not (pred_2 obj_19)))
)
)

; plan
1. (op_1 obj_05 obj_20)
   deleted: (pred_2 obj_05)
   added: (pred_2 obj_20)
   goals met: 0 of 2
2. (op_1 obj_20 obj_02)
   deleted: (pred_2 obj_20)
   added: (pred_2 obj_02)
   goals met: 0 of 2
3. (op_4 obj_02 obj_18)
   deleted: (pred_10 obj_18 obj_02) (pred_12)
   added: (pred_11 obj_18)
   goals met: 0 of 2
4. (op_1 obj_02 obj_20)
   deleted: (pred_2 obj_02)
   added: (pred_2 obj_20)
   goals met: 0 of 2
5. (op_1 obj_20 obj_07)
   deleted: (pred_2 obj_20)
   added: (pred_2 obj_07)
   goals met: 0 of 2
6. (op_1 obj_07 obj_12)
   deleted: (pred_2 obj_07)
   added: (pred_2 obj_12)
   goals met: 0 of 2
7. (op_1 obj_12 obj_01)
   deleted: (pred_2 obj_12)
   added: (pred_2 obj_01)
   goals met: 0 of 2
8. (op_5 obj_01 obj_06 obj_18)
   deleted: (pred_11 obj_18) (pred_10 obj_06 obj_01)
   added: (pred_11 obj_06) (pred_10 obj_18 obj_01)
   goals met: 0 of 2
9. (op_1 obj_01 obj_22)
   deleted: (pred_2 obj_01)
   added: (pred_2 obj_22)
   goals met: 0 of 2
10. (op_5 obj_22 obj_21 obj_06)
   deleted: (pred_11 obj_06) (pred_10 obj_21 obj_22)
   added: (pred_11 obj_21) (pred_10 obj_06 obj_22)
   goals met: 1 of 2
11. (op_1 obj_22 obj_01)
   deleted: (pred_2 obj_22)
   added: (pred_2 obj_01)
   goals met: 1 of 2
12. (op_5 obj_01 obj_18 obj_21)
   deleted: (pred_11 obj_21) (pred_10 obj_18 obj_01)
   added: (pred_11 obj_18) (pred_10 obj_21 obj_01)
   goals met: 2 of 2
